/**
 * Данные заполнители.
 *
 * @author Markitanov Vadim
 * @since 08.01.2025
 */
import { Tag } from '@/app/lib/model/entity/Tag'
import { WordEntity } from '@/app/lib/model/word'

const tags: Tag[] = [
  {
    id: 1,
    name: 'Числительные'
  },
  {
    id: 2,
    name: 'Цвета'
  },
  {
    id: 3,
    name: 'Фрукты'
  },
  {
    id: 4,
    name: 'Овощи',
    color: 'green'
  }
]

const words: WordEntity[] = [
  { id: 1, ru: 'Ноль', kg: 'Нөл', tag: 1 },
  { id: 2, ru: 'Один', kg: 'Бир', tag: 1 },
  { id: 3, ru: 'Два', kg: 'Эки', tag: 1 },
  { id: 4, ru: 'Три', kg: 'Үч', tag: 1 },
  { id: 5, ru: 'Четыре', kg: 'Төрт', tag: 1 },
  { id: 6, ru: 'Пять', kg: 'Беш', tag: 1 },
  { id: 7, ru: 'Шесть', kg: 'Алты', tag: 1 },
  { id: 8, ru: 'Семь', kg: 'Жети', tag: 1 },
  { id: 9, ru: 'Восемь', kg: 'Сегиз', tag: 1 },
  { id: 10, ru: 'Девять', kg: 'Тогуз', tag: 1 },
  { id: 11, ru: 'Десять', kg: 'Он', tag: 1 },
  { id: 12, ru: 'Двадцать', kg: 'Жыйырма', tag: 1 },
  { id: 13, ru: 'Тридцать', kg: 'Отуз', tag: 1 },
  { id: 14, ru: 'Сорок', kg: 'Кырк', tag: 1 },
  { id: 15, ru: 'Пятьдесят', kg: 'Элүү', tag: 1 },
  { id: 16, ru: 'Шестьдесят', kg: 'Алтымыш', tag: 1 },
  { id: 17, ru: 'Семьдесят', kg: 'Жетимиш', tag: 1 },
  { id: 18, ru: 'Восемьдесят', kg: 'Сексен', tag: 1 },
  { id: 19, ru: 'Девяносто', kg: 'Токсон', tag: 1 },
  { id: 20, ru: 'Тысяча', kg: 'Миң', tag: 1 },

  { id: 21, ru: 'Белый', kg: 'Ак', tag: 2 },
  { id: 22, ru: 'Черный', kg: 'Кара', tag: 2 },
  { id: 23, ru: 'Красный', kg: 'Кызыл', tag: 2 },
  { id: 24, ru: 'Зеленый', kg: 'Жашыл', tag: 2 },
  { id: 25, ru: 'Синий', kg: 'Көк', tag: 2 },
  { id: 26, ru: 'Желтый', kg: 'Сары', tag: 2 },
  { id: 27, ru: 'Оранжевый', kg: 'Кызгыл сары|Ачык күрөң', tag: 2 },
  { id: 28, ru: 'Фиолетовый', kg: 'Кызгылт көк', tag: 2 },
  { id: 29, ru: 'Розовый', kg: 'Кызыл, кызгылт', tag: 2 },
  { id: 30, ru: 'Коричневый', kg: 'Күрөң', tag: 2 },
  { id: 31, ru: 'Серый', kg: 'Боз, сур, көк', tag: 2 },
  { id: 32, ru: 'Голубой', kg: 'Көк', tag: 2 },
  { id: 33, ru: 'Бирюзовый', kg: 'Бирюза түстүү', tag: 2 },
  { id: 34, ru: 'Лиловый', kg: 'Кызгылт көгүш', tag: 2 },
  { id: 35, ru: 'Песочный', kg: 'Кум түстүү', tag: 2 },
  { id: 36, ru: 'Лавандовый', kg: '', tag: 2 },
  { id: 37, ru: 'Коралловый', kg: 'Шуру (маржан) түстүү', tag: 2 },
  { id: 38, ru: 'Золотой', kg: 'Алтын', tag: 2 },
  { id: 39, ru: 'Серебряный', kg: 'Күмүш', tag: 2 },
  { id: 40, ru: 'Бронзовый', kg: 'Коло түстүү', tag: 2 }
]

export { tags, words }